{
  "basics": {
    "name": "Steve Landey",
    "email": "steve@steveasleep.com",
    "url": "https://steveasleep.com",
    "location": {
      "city": "San Francisco, CA"
    },
    "summary": "I will work remotely, or within a 45 minute bike or transit commute from where I live in SF. For a better look at the shape of my current role and what I’m looking for in my next one, please click here: https://steveasleep.com/professional.html"
  },
  "work": [
    {
      "name": "Asana",
      "position": "Engineering Manager (2018-2020), Staff Mobile Engineer (2020-2024), AI Workflows (2024)",
      "startDate": "2018-01-01",
      "endDate": "2024-01-01",
      "summary": "As a manager, I supported the iOS and Android teams by coaching, mentoring, improving processes, and getting my hands dirty in code. In 2020, I decided to switch to a Staff Engineer role. I helped transform the iOS developer experience at Asana and shipped a lot of features.\n\nThroughout this time, I have been responsible for a few org-wide areas like maintaining the engineering blog, helping people release open source software, and running a tech talk series.\n\nAfter nine years doing iOS development, I switched stacks to be on the AI Workflows team in June 2024. So far, the shape of this work is writing TypeScript business logic and writing services in Python to support our AI efforts.\n\nThere is more detailed information about my time at Asana on the next page."
    },
    {
      "name": "Hipmunk",
      "position": "iOS Engineer (2015), Mobile Team Lead (2016), Engineering Manager (2017-2018)",
      "startDate": "2015-01-01",
      "endDate": "2018-01-01",
      "summary": "I helped move Hipmunk’s iOS codebase from startup spaghetti to MVVM while keeping a fast pace shipping features. I rewrote the mobile web flight search UI on a tight deadline to support acquisition by Concur, and integrated it seamlessly into the mobile apps to replace the native flight search UIs, while maintaining great UX. As a manager, I owned the mobile recruiting pipeline and hired 3 engineers."
    },
    {
      "name": "Graffiti Labs",
      "position": "Full Stack Engineer, Game Designer",
      "startDate": "2012-01-01",
      "endDate": "2015-01-01",
      "summary": "As one of two engineers, I helped design and build a realtime browser-based multiplayer sandbox building game played by thousands of people. I worked with performance-sensitive JavaScript, websockets, iOS (Swift and Obj-C), React, and Python."
    },
    {
      "name": "Yelp",
      "position": "Software Engineer on the Spam Team",
      "startDate": "2011-01-01",
      "endDate": "2012-01-01",
      "summary": "I worked on systems that ensure yelp.com only shows authentic reviews, including algorithms and internal tools. I also maintained mrjob, a popular framework that runs Python code on Hadoop."
    },
    {
      "name": "Apple",
      "position": "Intern on Obj-C Runtime Team",
      "startDate": "2010-01-01",
      "endDate": "2010-01-01",
      "summary": "I implemented an early prototype of the Xcode visual object graph debugging tool."
    },
    {
      "name": "MIM Software",
      "position": "Intern",
      "startDate": "2009-01-01",
      "endDate": "2009-01-01",
      "summary": "I built the first prototype of MIMcloud, a web site for HIPAA-compliant medical image sharing."
    }
  ],
  "projects": [
    {
      "name": "Locheck",
      "url": "https://github.com/asana/locheck",
      "startDate": "2021-01-01",
      "endDate": "2024-01-01",
      "description": "A linter for iOS and Android localization. Used by Asana and other companies, including GitHub."
    },
    {
      "name": "Browserboard",
      "url": "https://browserboard.com",
      "startDate": "2020-01-01",
      "endDate": "2023-01-01",
      "description": "A multiuser whiteboard web app with thousands of users built with Django, Node.js, Vue, and websockets. Built from scratch and sold to an Australian education company."
    },
    {
      "name": "Oscillator Drum Loops",
      "url": "https://oscillatordrums.com",
      "startDate": "2019-01-01",
      "endDate": "2020-01-01",
      "description": "An iPhone and iPad app companion to a drum instruction book. The app contains over 140 exercises with sheet music and music loops that can be played back at variable tempos with a metronome. It is fully VoiceOver-accessible, and its layout works in portrait and landscape mode all the way from iPhone SE up to iPad Pro."
    }
  ],
  "education": [
    {
      "institution": "Case Western Reserve University",
      "area": "Computer Science",
      "studyType": "B.S. & M.S.",
      "startDate": "2007-01-01",
      "endDate": "2012-01-01",
      "summary": "B.S. and M.S. in Computer Science. Organizer for CWRU Hacker Society, which is a series of tech talks and a touchpoint for the student community."
    }
  ],
  "skills": [
    {
      "name": "Mobile",
      "keywords": [
        "Swift",
        "Objective-C",
        "UIKit",
        "ReactiveSwift",
        "Combine",
        "Core Data",
        "Tuist",
        "AudioKit"
      ]
    },
    {
      "name": "Web",
      "keywords": [
        "JavaScript",
        "TypeScript",
        "Python",
        "React",
        "Vue",
        "Django",
        "Flask",
        "Pyramid",
        "CSS (I’m serious)",
        "Node.js",
        "websockets"
      ]
    }
  ]
}