{
  "work_history": [
    {
      "title": "Asana",
      "subtitle": "Engineering Manager (2018-2020), Staff Mobile Engineer (2020-Present)",
      "years": "2018–Present",
      "url": null,
      "description": [
        "As a manager, I supported the iOS and Android teams by coaching, mentoring, improving processes, and getting my hands dirty in code. In 2020, I decided to switch to a Staff Engineer role. Now I’m on the Mobile Foundations team and I’m responsible for many aspects of mobile architecture at Asana, helping engineers on four teams work as effectively as possible.",
        "In addition to my work with the iOS and Android teams, I’ve also helped the engineering intern program run smoothly, edited most Asana Engineering blog posts, and facilitated the release of open source software. I also helped design and build a complex web-based text editor that’s also used in the mobile apps."
      ]
    },
    {
      "title": "Hipmunk",
      "subtitle": "iOS Engineer (2015), Mobile Team Lead (2016), Engineering Manager (2017-2018)",
      "years": "2015–2018",
      "url": null,
      "description": [
        "I helped move Hipmunk’s iOS codebase from startup spaghetti to MVVM while keeping a fast pace shipping features. I rewrote the mobile web flight search UI on a tight deadline to support acquisition by Concur, and integrated it seamlessly into the mobile apps to replace the native flight search UIs, while maintaining great UX. As a manager, I owned the mobile recruiting pipeline and hired 3 solid engineers."
      ]
    },
    {
      "title": "Graffiti Labs",
      "subtitle": "Full Stack Engineer, Game Designer",
      "years": "2012–2015",
      "url": null,
      "description": [
        "As one of two engineers, I helped design and build a realtime browser-based multiplayer sandbox building game played by thousands of people. I worked with performance-sensitive JavaScript, websockets, iOS (Swift and Obj-C), React.JS, and Python."
      ]
    },
    {
      "title": "Yelp",
      "subtitle": "Software Engineer on the Spam Team",
      "years": "2011–2012",
      "url": null,
      "description": [
        "I worked on systems that ensure yelp.com only shows authentic reviews, including algorithms and internal tools. Maintained mrjob, a popular framework that runs Python code on Hadoop."
      ]
    },
    {
      "title": "Apple",
      "subtitle": "Intern on Obj-C Runtime Team",
      "years": "2010",
      "url": null,
      "description": [
        "I implemented an early prototype of the Xcode visual object graph debugging tool."
      ]
    },
    {
      "title": "MIM Software",
      "subtitle": "Intern",
      "years": "2009",
      "url": null,
      "description": [
        "I built the first prototype of MIMcloud, a web site for HIPAA-compliant medical image sharing."
      ]
    }
  ],
  "personal_projects": [
    {
      "title": "Browserboard",
      "subtitle": null,
      "years": "2020",
      "url": "https://browserboard.com",
      "description": [
        "A multiuser whiteboard web app with thousands of users built with Django, Node.js, Vue, and websockets."
      ]
    },
    {
      "title": "Oscillator Drum Loops",
      "subtitle": null,
      "years": "2019",
      "url": "https://oscillatordrums.com",
      "description": [
        "An iPhone and iPad app companion to a drum instruction book. The app contains over 140 exercises with sheet music and music loops that can be played back at variable tempos with a metronome. The app is fully VoiceOver-accessible, and its layout works in portrait and landscape mode all the way from iPhone SE up to iPad Pro."
      ]
    },
    {
      "title": "Literally Canvas",
      "subtitle": null,
      "years": "2012",
      "url": "http://literallycanvas.com",
      "description": [
        "An extensible JavaScript library for embedding an MS Paint-like drawing widget in web pages. This project has been used in many surprising places over its long lifetime."
      ]
    },
    {
      "title": "Hobbyist Game Development",
      "subtitle": null,
      "years": "2003–Present",
      "url": null,
      "description": [
        "20+ small games in BASIC, Python, JavaScript, and Swift.",
        "Art and music of uneven quality."
      ]
    }
  ],
  "education": [
    {
      "title": "Case Western Reserve University",
      "subtitle": null,
      "years": "2007–2012",
      "url": null,
      "description": [
        "B.S. and M.S. in Computer Science. Organizer for CWRU Hacker Society, which is a series of tech talks and a touchpoint for the student community. Pianist for IMPROVment comedy troupe."
      ]
    }
  ]
}